
/*
  9. В массиве целых чисел с количеством элементов n 
     найти наиболее часто встречающееся число. 
     Если таких чисел несколько, то определить наименьшее из них. 
*/

package Task_1_9;

import java.util.ArrayList;

public class Task_1_9 {

	public static void main(String[] args) {
		
		System.out.println("ПРОГРАММА : В МАССИВЕ ЦЕЛЫХ ЧИСЕЛ НАЙТИ НАИБОЛЕЕ ЧАСТО ВСТРЕЧАЮЩЕЕСЯ ЧИСЛО");
		System.out.println("--------------------------------------------------------------------------");
		System.out.println("--------------------------------------------------------------------------");
		
		System.out.println("Введите размер массива A[N] : N - Размер массива");
		System.out.println("------------------------------------------------");
		
		Task_1_9_res Inp = new Task_1_9_res();
		
		int N = 0;
		
		 do {
			 N = Inp.InputInt();
			 
			 if ( N <= 0 )
            {
          	  System.out.println("--------------------------------------------------");
          	  System.out.println("Введенные данные меньше или равно 0. Введите снова");
          	  System.out.println("--------------------------------------------------");
            } 
          
		  } while ( N <= 0 );
		 
		  // Объявление одномерного массива размерностью N
	         int nums[] = new int[N];
	     
	      // Заполнение массива рандомно
		  	 for ( int i = 0; i < N; i++ ) {
		  		    nums[i] = -100 + (int) ( Math.random()*(100-(-100)) );
		  			}
		  	 
		  // Вывод массива целых чисел на печать
			  System.out.println("-------------------------------------");
			  System.out.println("Вывод массива целых чисел на печать :");
			  System.out.println("-------------------------------------"); 
			  
			  for ( int i = 0; i < nums.length; i++) {
		            System.out.println("-------------------------------------------------------------------");
		            System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] );
		            System.out.println("-------------------------------------------------------------------");
					    } 
				
				 System.out.println("-------------------------------------------------------------------");
				 
				 
				// В массиве целых чисел с количеством элементов n найти наиболее часто встречающееся число.
			    // Если таких чисел несколько, то определить наименьшее из них. 
				 
				 System.out.println("-------------------------------------------");
				 System.out.println("Количество одинаковых элементов в массиве :");
				 System.out.println("-------------------------------------------"); 
				 
			  // Объявление нового одномерного массива размерностью ArrayList : 1. Номер элемента первого массива  2. Количество элементов в первом массиве
				 ArrayList<Integer> nums2 = new ArrayList<Integer>();
				 
				 int count = 0; 
				 for ( int i = 0; i < nums.length; i++) {
				              count = 0; 
				              for ( int j = 0; j < nums.length; j++) {
					                if( (nums[i] == nums[j]) & (i != j) ) {
						            count = count + 1;
					                    }
				                    }
				              
				              nums2.add(count+1);
				              
				              System.out.println("------------------------------------------------------------------------------------------------------------");
				              System.out.println( "Номер элемента массива :  " + i + "  ||  " + "Значение элемента массива :  " + nums[i] + "  ||  " + "Количество элементов в массиве :  " + (count+1) );
				              System.out.println("------------------------------------------------------------------------------------------------------------");
				 } 
				 
				 
				 /* for ( int i = 0; i < nums2.size(); i++) {
			            System.out.println("-------------------------------------------------------------------");
			            System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums2.get(i) );
			            System.out.println("-------------------------------------------------------------------");
						    } 
			     */
				 
				 // Поиск элементов с одинаковым значением
				 int countmax = 0;
				 countmax = nums2.get(0);
				 
				 for ( int i = 0; i < nums2.size(); i++ ) {
					 if ( countmax < nums2.get(i) ) {
						 countmax = nums2.get(i);
					 }
				 }
				 
				System.out.println("--------------------------------------------------------------");
				System.out.println("Наибольшее количество элементов с одинаковым значением :  " + countmax);
				System.out.println("--------------------------------------------------------------");
				
				// Объявление нового одномерного массива размерностью ArrayList : 
				 ArrayList<Integer> nums3 = new ArrayList<Integer>();
				 
                for ( int i = 0; i < nums2.size(); i++ ) {
					 
					 if ( countmax == nums2.get(i)) {
						 System.out.println("------------------------------------------------------------------------------------------------------------------");
						 System.out.println( "Номер элемента массива 2 :  " +  i + "  ||  " + "Значение элемента массива 2 :  " + nums[i] + "  ||  " +  "Количество элементов в массиве 1 :  " + countmax ); 
						 System.out.println("------------------------------------------------------------------------------------------------------------------");
						 nums3.add(nums[i]);
					 }
					 
				 }
				
                
             /*   for ( int i = 0; i < nums3.size(); i++) {
	            System.out.println("-------------------------------------------------------------------");
	            System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums3.get(i) );
	            System.out.println("-------------------------------------------------------------------");
				    } 
		     */
                
                 // Поиск Наименьшего числа массива из наиболее встречающихся в нём
                 int elemmin = nums3.get(0);
				 
				 for ( int i = 0; i < nums3.size(); i++ ) {
					 
					 if ( elemmin >  nums3.get(i) ) {
						 elemmin = nums3.get(i);
						 //System.out.println("----------------------------------------------------------------------------------------------------------");
						// System.out.println( "Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] + "  ||  " +  "Количество элементов в массиве :  " + countmax ); 
						// System.out.println("----------------------------------------------------------------------------------------------------------");
					 }
				 } 
               
				System.out.println("----------------------------------------------------------------------------------------------------------");
				System.out.println("Наименьшее число массива из наиболее встречающихся в нём :  " + elemmin + "  ||  " + "Количество элементов в массиве :  " + countmax );
				System.out.println("----------------------------------------------------------------------------------------------------------");
	}
}
