	
// 6. Сформировать квадратную матрицу порядка n по заданному образцу. n - четное.
	
package Task_2_6;
	
public class Task_2_6 {
	
	public static void main(String[] args) {
		
		int check = 0;
		
		do {
			System.out.println("-------------------------------------------");
			System.out.println("ПРОГРАММА : ФОРМИРОВАНИЕ КВАДРАТНОЙ МАТРИЦЫ");
			System.out.println("-------------------------------------------");
			
			System.out.println("Введите размер массива A[X][Y] :");
			System.out.println("------------------------------------");
			System.out.println("X - Число строк. Y - Число столбцов.");
			System.out.println("------------------------------------");
			System.out.println("Матрица квадратная. Число строк равно числу столбцов");
			System.out.println("----------------------------------------------------");
			
			
			// Ввод числа строк и столбцов матрицы
			System.out.println("Введите число строк и столбцов квадратной матрицы :");
			System.out.println("---------------------------------------------------");
			System.out.println("Число строк и столбцов квадратной матрицы - ЧЁТНОЕ");
			System.out.println("---------------------------------------------------");
			
			int X = 0; // Число строк квадратной матрицы
			int Y = 0; // Число столбцов квадратной матрицы
			
			do {
				X = Task_2_6_res.InputInt();
				
				if ( X <= 0 )
					{
					System.out.println("--------------------------------------------------");
					System.out.println("Введенные данные меньше или равно 0. Введите снова");
					System.out.println("--------------------------------------------------");
					}
					
				if ( X%2 != 0 & X > 0 )
					{
					System.out.println("----------------------------------------------");
					System.out.println("Нечётное число строк и столбцов. Введите снова");
					System.out.println("----------------------------------------------");
					}
					
				} while ( X <= 0 | X%2 != 0);
				
			Y = X;
			int YY = Y;
			
			// Объявление двумерного массива
			int[][] array = new int[X][Y];
			
			// Заполнение двумерного массива
			
			for (int i = 0; i < X ; i++) {
				
				for (int j = 0; j < Y; j++) {
					
					if ( i < ( X/2 ) ) {
						
						if ( (j - 1 ) < ( i - 1 ) | j > ( YY - 1 - i ) ) {
								
								array[i][j] = 0;
								
						} else {
							
							array[i][j] = 1;
							
							}
							
					}  else  if ( i > ( X/2 - 1 ) ) {
						
						if ( (j - 1) > ( i - 1) | j < (YY - 1 - i) ) {
										
										array[i][j] = 0;
										
								} else {
										array[i][j] = 1;
										
										}
					}
				}
			}
			
			// Вывод двумерного массива на печать
			System.out.println("------------------------------------");
			System.out.println("Вывод двумерного массива на печать :");
			System.out.println("------------------------------------");
			
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
				
				for (int i = 0; i < array.length; i++) { // X - Число строк
					
					for (int j = 0; j < array[i].length; j++) { // Y - Число столбцов
						
						System.out.printf( "%4d   ",array[i][j]);
						//System.out.print(array[i][j] + "\t");
						// System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t");
					}
					
					System.out.println();
					
				}
				System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
				
				System.out.println("-----------------------------------------------");
				System.out.println("ПРОДОЛЖИТЬ РАБОТУ ПРОГРАММЫ ?   1 - ДА. 0 - НЕТ");
				System.out.println("-----------------------------------------------");
				
				do {
					System.out.println("Введите : 1 - Да или 0 - Нет");
					System.out.println("----------------------------");
					
					check = Task_2_6_res.InputInt();
					
					if ( check < 0 | check > 1 )
						{
						System.out.println("------------------------------------------------");
						System.out.println("Введеные данные не равны 0 или 1. Введите снова.");
						System.out.println("------------------------------------------------");
						}
						
				} while ( check < 0 | check > 1 );
				
				try {
					Thread.sleep(1500);
					}
					catch(InterruptedException ex)
						{
						System.out.println("-------------------------");
						System.out.println("Ошибка в работе программы");
						System.out.println("-------------------------");
						}
						
		} while ( check == 1 );
	}
}
