
/* 1. В массив A [N] занесены натуральные числа. 
      Найти сумму тех элементов, которые кратны данному К
*/

package Task_1_1;

public class Task_1_1 {

	public static void main(String[] args) {
		
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ СУММЫ ЭЛЕМЕНТОВ МАССИВА, КОТОРЫЕ КРАТНЫ К");
		System.out.println("--------------------------------------------------------------------------------");
		System.out.println("--------------------------------------------------------------------------------");
		
		
		
		

	}

}
