
// 3. Дана матрица. Вывести k-ю строку и p-й столбец матрицы.

package Task_2_3;

public class Task_2_3 {

	public static void main(String[] args) {
		
		System.out.println("ПРОГРАММА : ВЫВОД МАТРИЦЫ НА ЭКРАН");
		System.out.println("----------------------------------");
		System.out.println("----------------------------------");
		
		System.out.println("Введите размер массива A[X][Y] :");
		System.out.println("------------------------------------");
		System.out.println("X - Число строк. Y - Число столбцов.");
		System.out.println("------------------------------------");
		
		Task_2_3_res Inp = new Task_2_3_res();
		
		// Ввод числа строк матрицы
		System.out.println("Введите :  X - Число строк : ");
		
		int X = 0;
		
		 do {
			 X = Inp.InputInt();
			 
			 if ( X <= 0 )
          {
        	  System.out.println("--------------------------------------------------");
        	  System.out.println("Введенные данные меньше или равно 0. Введите снова");
        	  System.out.println("--------------------------------------------------");
          } 
        
		  } while ( X <= 0 );
		
		 
		// Ввод числа столбцов матрицы
		System.out.println("Введите : Y - Число столбцов : ");
		
		int Y = 0;
		
		 do {
			 Y = Inp.InputInt();
			 
			 if ( Y <= 0 )
          {
        	  System.out.println("--------------------------------------------------");
        	  System.out.println("Введенные данные меньше или равно 0. Введите снова");
        	  System.out.println("--------------------------------------------------");
          } 
        
		  } while ( Y <= 0 );
		 
		 
		 // Ввод k-ой строки.
		    System.out.println("Введите номер строки, которую нужно вывести :");
			System.out.println("---------------------------------------------");
			
			 int K = 0;
			
			do {
			     K = Inp.InputInt();
			    
			    if ( K <= 0 )
		          {
		        	  System.out.println("--------------------------------------------------");
		        	  System.out.println("Введенные данные меньше или равно 0. Введите снова");
		        	  System.out.println("--------------------------------------------------");
		          } 
			    
			    if ( K > X )
		          {
		        	  System.out.println("-------------------------------");
		        	  System.out.println("Такой строки нет. Введите снова");
		        	  System.out.println("-------------------------------");
		          } 
			      
			
			} while ( K <= 0 | K > X);
			
			
		// Ввод p-ой столбца.
			System.out.println("Введите номер столбца, который нужно вывести :");
			System.out.println("----------------------------------------------");
			
			int P = 0;
			
			do {
			    P = Inp.InputInt();
			    
			    if ( P <= 0 )
		          {
		        	  System.out.println("--------------------------------------------------");
		        	  System.out.println("Введенные данные меньше или равно 0. Введите снова");
		        	  System.out.println("--------------------------------------------------");
		          } 
			    
			    if ( P > Y )
		          {
		        	  System.out.println("---------------------------------");
		        	  System.out.println("Такого столбца нет. Введите снова");
		        	  System.out.println("---------------------------------");
		          } 
			
			} while ( P <= 0 | P > Y);
			
			
			
			
		// Объявление двумерного массива
		  int[][] array = new int[X][Y];
		  
		// Заполнение двумерного массива рандомно	  
		  for (int i = 0; i < X; i++) {
		        for (int j = 0; j < Y; j++) {
		            array[i][j] = -100 + (int) ( Math.random()*(100-(-100)) );
		        }
		    } 
		  
		  
		 // Вывод двумерного массива на печать
		  System.out.println("----------------------------------------------------");
		  System.out.println("Вывод первоначального двумерного массива на печать :");
		  System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		     for (int i = 0; i < array.length; i++) {  // X - Число строк
				for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
					
					System.out.printf( "%4d  (%2d %2d)  ",array[i][j],i,j );
				  //System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t");
				}
				System.out.println();
		   	} 
		
		    System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		  
		 
		    
		  // Вывод двумерного массива на печать. Вывод k-ой строки.
			 System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			 System.out.println("ВЫВОД K-ой СТРОКИ :");
			 System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			 
			     for (int i = 0; i < array.length; i++) {  // X - Число строк
			    	 
					for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
						
						   if ( (K - 1) == i ) {
							   
					    System.out.printf( "%4d  (%2d %2d)  ",array[i][j],i,j );	   
					  //System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t");
						
						   } 
						   else { System.out.printf( "           "  + "\t" ); }
						
					}
					
					System.out.println();
			   	} 
			
			    System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			    
			    
			    
		    // Вывод двумерного массива на печать. Вывод p-ого столбца.
				System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
				System.out.println("ВЫВОД P-ого СТОЛБЦА :");
				System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
				 
				     for (int i = 0; i < array.length; i++) {  // X - Число строк
				    	 
						for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
							
							   if ( (P - 1) == j ) {
								   
						    System.out.printf( "%4d  (%2d %2d)  ",array[i][j],i,j );	   
						  //System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t");
							
							   }
							   else { System.out.printf( "           "  + "\t" ); }
							
						}
						
						System.out.println();
				   	} 
				
				    System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
	}

}
