	
/*
	1. Написать метод (методы) для нахождения наибольшего общего делителя и наименьшего общего кратного двух
		натуральных чисел : НОК(A.B) = (A*B) / НОД(A,B)
*/
	
package Task_4_1;
	
public class Task_4_1 {
	
	public static void main(String[] args) {
		
		System.out.println("--------------------------------");
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ НОД И НОК");
		System.out.println("--------------------------------");
		System.out.println("--------------------------------");
		
		// Ввод двух натуральных чисел
		System.out.println("Введите ПЕРВОЕ натуральное число : A");
		System.out.println("------------------------------------");
		
		int A = 0;
		
		do {
			A = Task_4_1_res.InputInt();
			
		if ( A <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
		} while ( A <= 0 );
		
		
		System.out.println("Введите ВТОРОЕ натуральное число : B");
		System.out.println("------------------------------------");
		
		int B = 0;
		
		do {
			B = Task_4_1_res.InputInt();
			
		if ( B <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
		} while ( B <= 0 );
		
		
		// Вычисление наибольшего общего делителя и наименьшего общего кратного двух натуральных чисел
		
		// Вычисление наибольшего общего делителя
		int NOD = Task_4_1_res.Nod1(A,B);
		
		// Вычисление наименьшего общего кратного
		
		int NOK = Task_4_1_res.Nok1(A, B);
		
		// int NOK = Inp.lcm2(A, B);
		
		System.out.println("-------------------------------------------------------------------------------------------------------------");
		System.out.println("ВЫЧИСЛЕНИЕ НАИБОЛЬШЕГО ОБЩЕГО ДЕЛИТЕЛЯ ( НОД ) И НАИМЕНЬШЕГО ОБЩЕГО КРАТНОГО ( НОК ) ДВУХ НАТУРАЛЬНЫХ ЧИСЕЛ :");
		System.out.println("-------------------------------------------------------------------------------------------------------------");
		System.out.println("НАИБОЛЬШИЙ ОБЩИЙ ДЕЛИТЕЛЬ = " + NOD + "  ||  " + "НАИМЕНЬШЕЕ ОБЩЕЕ КРАТНОЕ = " + NOK);
		System.out.println("-------------------------------------------------------------------");
		
	}
	
}
