
/*
  11. Матрицу 10x20 заполнить случайными числами от 0 до 15. 
      Вывести на экран саму матрицу и номера строк, в
      которых число 5 встречается три и более раз.
*/

package Task_2_11;

public class Task_2_11 {

	static Task_2_11_res object  = new Task_2_11_res();
	
	public static void main(String[] args) {
		
		System.out.println("------------------------------------------------------------------------");
		System.out.println("ПРОГРАММА : ФОРМИРОВАНИЕ МАТРИЦЫ : ЧИСЛО СТРОК - 10, ЧИСЛО СТОЛБЦОВ - 20");
		System.out.println("------------------------------------------------------------------------");
		
		int X = 10; // Число строк матрицы
		int Y = 20; // Число столбцов матрицы
		
		// Объявление двумерного массива
		int[][] array = new int[X][Y];
		
		// Заполнение двумерного массива 
		object.FillMass(array, X, Y);
		    
        // Вывод двумерного массива на печать
		  System.out.println("------------------------------------");
		  System.out.println("Вывод двумерного массива на печать :");
		  System.out.println("------------------------------------");
		  
          System.out.println("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		  
          object.PrintMass(array);
          
		  System.out.println("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		 // Вывод на экран номера строк и строк матрицы, в которых число 5 встречается три и более раз.
		  
		 System.out.println("--------------------------------------------------------------------------------------------");
		 System.out.println("Вывод на экран номера строк и строк матрицы, в которых число 5 встречается три и более раз :");
		 System.out.println("--------------------------------------------------------------------------------------------");
		  
         System.out.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		  
         object.PrintMass1(array);
      
		 System.out.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------"); 
	}
}
