	
/*
	11. Матрицу 10x20 заполнить случайными числами от 0 до 15.
		Вывести на экран саму матрицу и номера строк, в
		которых число 5 встречается три и более раз.
*/
	
package Task_2_11;
	
public class Task_2_11 {
	
	static Task_2_11_res object1 = new Task_2_11_res();
	
	public static void main(String[] args) {
		
		int check = 0;
		
		do {
			System.out.println("------------------------------------------------------------------------");
			System.out.println("ПРОГРАММА : ФОРМИРОВАНИЕ МАТРИЦЫ : ЧИСЛО СТРОК - 10, ЧИСЛО СТОЛБЦОВ - 20");
			System.out.println("------------------------------------------------------------------------");
		
			int X = 10; // Число строк матрицы
			int Y = 20; // Число столбцов матрицы
		
			// Объявление двумерного массива
			int[][] array = new int[X][Y];
		
			// Заполнение двумерного массива 
			object1.FillMass(array, X, Y);
		
			// Вывод двумерного массива на печать
			System.out.println("------------------------------------");
			System.out.println("Вывод двумерного массива на печать :");
			System.out.println("------------------------------------");
		
			System.out.println("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
			object1.PrintMass(array);
		
			System.out.println("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
			// Вывод на экран номера строк и строк матрицы, в которых число 5 встречается три и более раз.
		
			System.out.println("--------------------------------------------------------------------------------------------");
			System.out.println("Вывод на экран номера строк и строк матрицы, в которых число 5 встречается три и более раз :");
			System.out.println("--------------------------------------------------------------------------------------------");
		
			System.out.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
			object1.PrintMass1(array);
		
			System.out.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------"); 
			
			System.out.println("-----------------------------------------------");
			System.out.println("ПРОДОЛЖИТЬ РАБОТУ ПРОГРАММЫ ?   1 - ДА. 0 - НЕТ");
			System.out.println("-----------------------------------------------");
			
			do	{
				System.out.println("Введите : 1 - Да или 0 - Нет");
				System.out.println("----------------------------");
				
				check = object1.InputInt();
				
				if ( check < 0 | check > 1 ) 
					{
						System.out.println("------------------------------------------------");
						System.out.println("Введеные данные не равны 0 или 1. Введите снова.");
						System.out.println("------------------------------------------------");
					}
				
			} while ( check < 0 | check > 1 );
			
			try {
					Thread.sleep(1500);
				}
					catch(InterruptedException ex) 
						{
							System.out.println("-------------------------");
							System.out.println("Ошибка в работе программы");
							System.out.println("-------------------------");
						}
		
		} while ( check == 1 );
	}
}
