	
	// 10. Найти положительные элементы главной диагонали квадратной матрицы.
	
package Task_2_10;
	
public class Task_2_10 {
	
	public static void main(String[] args) {
		
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ ПОЛОЖИТЕЛЬНЫХ ЭЛЕМЕНТОВ ГЛАВНОЙ ДИАГОНАЛИ КВАДРАТНОЙ МАТРИЦЫ");
		System.out.println("-----------------------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------------------");
		
		System.out.println("Введите размер массива A[X][Y] :");
		System.out.println("------------------------------------");
		System.out.println("X - Число строк. Y - Число столбцов.");
		System.out.println("------------------------------------");
		System.out.println("Матрица квадратная. Число строк равно числу столбцов");
		System.out.println("----------------------------------------------------");
		
		Task_2_10_res Inp = new Task_2_10_res();
		
		// Ввод числа строк и столбцов матрицы
		
		System.out.println("Введите число строк и столбцов квадратной матрицы :");
		System.out.println("---------------------------------------------------");
		
		int X = 0; // Число строк квадратной матрицы
		int Y = 0; // Число столбцов квадратной матрицы
		
		do {
			X = Inp.InputInt();
			
			if ( X <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
			
		} while ( X <= 0 );
		
		Y = X;
		
		// Объявление двумерного массива
		int[][] array = new int[X][Y];
		
		// Заполнение двумерного массива
		
		for (int i = 0; i < X; i++) {
			for (int j = 0; j < Y; j++) {
				array[i][j] = -100 + (int) ( Math.random()*(100-(-100)) );
			}
		}
		
		// Вывод двумерного массива на печать
		
		System.out.println("------------------------------------");
		System.out.println("Вывод двумерного массива на печать :");
		System.out.println("------------------------------------");
		
		System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		for (int i = 0; i < array.length; i++) {  // X - Число строк
			
			for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
				
				//System.out.print(array[i][j] + "\t");
				//System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t" );
				System.out.printf( "%4d  (%2d %2d)  ",array[i][j],i,j );
				}
				System.out.println();
			}
		System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		// ВЫЧИСЛЕНИЕ ПОЛОЖИТЕЛЬНЫХ ЭЛЕМЕНТОВ ГЛАВНОЙ ДИАГОНАЛИ КВАДРАТНОЙ МАТРИЦЫ
		
		System.out.println("---------------------------------------------------------------------------");
		System.out.println("ВЫЧИСЛЕНИЕ ПОЛОЖИТЕЛЬНЫХ ЭЛЕМЕНТОВ В ГЛАВНОЙ ДИАГОНАЛИ КВАДРАТНОЙ МАТРИЦЫ :");
		System.out.println("---------------------------------------------------------------------------");
		
		System.out.println("-----------------------------------------------------------------------------");
		
		int count = 0; // Всего положительных элементов в главной диагонали квадратной матрицы
		
		for (int i = 0; i < array.length; i++) {  // X - Число строк
			
			for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
				
				if ( (i == j) & (array[i][j] > 0)  ) {
					count = count + 1;
					
					System.out.printf( "Номер строки : %3d   ||   Номер столбца : %3d  ||  Значение элемента : %4d%n",i,j,array[i][j]);
					
					//System.out.println("Номер строки : " + i + "  ||  " + "Номер столбца : " + j + "  ||  " +  "Значение элемента : "+ array[i][j] );
					System.out.println("-----------------------------------------------------------------------------");
					}
				}
		}
		System.out.println("-----------------------------------------------------------------------------");
		System.out.println("Всего положительных элементов в главной диагонали квадратной матрицы : " + "  " + count);
		System.out.println("-----------------------------------------------------------------------------");
	}
}
