	
/*
	8. В числовой матрице поменять местами два любых столбца,
		т. е. все элементы одного столбца поставить на соответствующие
		им позиции другого, а его элементы второго переместить в первый.
		Номера столбцов вводит пользователь с клавиатуры.
*/
	
package Task_2_8;
	
public class Task_2_8 {
	
	public static void main(String[] args) {
		
		System.out.println("------------------------------------------------------");
		System.out.println("ПРОГРАММА : ДВА ЛЮБЫХ СТОЛБЦА МАТРИЦЫ МЕНЯЮТСЯ МЕСТАМИ");
		System.out.println("------------------------------------------------------");
		
		System.out.println("Введите размер массива A[X][Y] :");
		System.out.println("------------------------------------");
		System.out.println("X - Число строк. Y - Число столбцов.");
		System.out.println("------------------------------------");
		
		
		// Ввод числа строк матрицы
		System.out.println("Введите :  X - Число строк : ");
		int X = 0;
		
		do {
			X = Task_2_8_res.InputInt();
			
			if ( X <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( X <= 0 );
		
		// Ввод числа столбцов матрицы
		System.out.println("Введите : Y - Число столбцов : ");
		int Y = 0;
		
		do {
			Y = Task_2_8_res.InputInt();
			
			if ( Y <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( Y <= 0 );
			
			
		// Ввод Первого столбца, который нужно переместить
		System.out.println("Введите номер Первого столбца, который нужно переместить :");
		System.out.println("----------------------------------------------------------");
		
		int Y1 = 0;
		
		do {
			Y1 = Task_2_8_res.InputInt();
			
			if ( Y1 <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			if ( Y1 > Y )
				{
				System.out.println("---------------------------------");
				System.out.println("Такого столбца нет. Введите снова");
				System.out.println("---------------------------------");
				}
				
			} while ( Y1 <= 0 | Y1 > Y);
			
			
		// Ввод Второго столбца, который нужно переместить
		System.out.println("Введите номер Второго столбца, который нужно переместить :");
		System.out.println("----------------------------------------------------------");
		
		int Y2 = 0;
		
		do {
			Y2 = Task_2_8_res.InputInt();
			
			if ( Y2 <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			if ( Y2 > Y )
				{
				System.out.println("---------------------------------");
				System.out.println("Такого столбца нет. Введите снова");
				System.out.println("---------------------------------");
				}
				
		} while ( Y2 <= 0 | Y2 > Y);
		
		
		// Объявление двумерного массива
		int[][] array = new int[X][Y];
		
		// Заполнение двумерного массива рандомно
		for (int i = 0; i < X; i++) {
			
			for (int j = 0; j < Y; j++) {
				
				array[i][j] = -100 + (int) ( Math.random()*(100-(-100)) );
			}
		}
		
		
		// Вывод двумерного массива на печать
		System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		for (int i = 0; i < array.length; i++) {  // X - Число строк
			
			for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
				
				System.out.printf( "%4d  (%2d %2d)  ",array[i][j],i,j );
				//System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t");
			}
			
			System.out.println();
		}
		
		System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		
				// ДВА ЛЮБЫХ СТОЛБЦА МАТРИЦЫ МЕНЯЮТСЯ МЕСТАМИ
		
		int num1 = 0;
		int num2 = 0;
		
		for (int i = 0; i < X; i++) {
			
			for (int j = 0; j < Y; j++) {
				
				if ( ( Y1 - 1) == j ) {
					
					num1 = array[i][j];
				}
			}
			
			for (int j = 0; j < Y; j++) {
				
				if ( ( Y2 - 1) == j ) {
					
					num2 = array[i][j];
					
					array[i][j] = num1;
				}
			}
			
			
			for (int j = 0; j < Y; j++) {
				
				if ( ( Y1 - 1) == j ) {
					
					array[i][j] = num2;
				}
			}
			
			num1 = 0;
			num2 = 0;
		}
		
		
		// Вывод изменённого двумерного массива на печать
		System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		for (int i = 0; i < array.length; i++) {  // X - Число строк
			
			for (int j = 0; j < array[i].length; j++) {  // Y - Число столбцов
				
				System.out.printf( "%4d  (%2d %2d)  ",array[i][j],i,j );
				//System.out.print(array[i][j] + "  ( " + i + " " + j + " )  " + "\t");
			}
			
			System.out.println();
		}
		
		System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
	}
	
}
