	
/*
	6. Задана последовательность N вещественных чисел.
		Вычислить сумму чисел, порядковые номера которых
		являются простыми числами.
*/
	
package Task_1_6;
	
import java.math.BigDecimal;
	
import java.math.RoundingMode;
	
public class Task_1_6 {
	
	public static void main(String[] args) {
		
		System.out.println("------------------------------------------------------------------------------------------------------------");
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ СУММЫ ЧИСЕЛ В ПОСЛЕДОВАТЕЛЬНОСТИ, ПОРЯДКОВЫЕ НОМЕРА КОТОРЫХ ЯВЛЯЮТСЯ ПРОСТЫМИ ЧИСЛАМИ");
		System.out.println("------------------------------------------------------------------------------------------------------------");
		
		System.out.println("Введите размер массива A[N] : N");
		System.out.println("----------------------------------");
		
		int N = 0;
		
		do {
			N = Task_1_6_res.InputInt();
			
			if ( N <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
		} while ( N <= 0 );
		
		// Объявление одномерного массива размерностью N
		double nums[] = new double[N];
		
		// Заполнение массива рандомно
		double value = 0;
		
		for ( int i = 0; i < N; i++ ) {
				
				value = -100 + ( Math.random() * (100 - (-100) ) );
				BigDecimal result = new BigDecimal(value);
				
				result = result.setScale(3, RoundingMode.UP );
				nums[i] = result.doubleValue();
				}
				
			// Вывод первоначального массива на печать
			System.out.println("-----------------------------------------");
			System.out.println("Вывод первоначального массива на печать :");
			System.out.println("-----------------------------------------");
			
			for ( int i = 0; i < nums.length; i++) {
				
				System.out.println("---------------------------------------------------------------------");
				System.out.printf( "Номер элемента массива : %2d  ||  Значение элемента массива : %5.3f%n", i, nums[i] );
				// System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] );
				System.out.println("---------------------------------------------------------------------");
				}
				
			System.out.println("---------------------------------------------------------------------");
			
			
			// Вывод на печать элементов первоначального массива, порядковые номера элементов являются простыми числами
			
			System.out.println("-------------------------------------------------------------------------------------------------------------------");
			System.out.println("Вывод на печать элементов первоначального массива, порядковые номера элементов которого являются простыми числами :");
			System.out.println("-------------------------------------------------------------------------------------------------------------------");
			
			int count = 0; // Количество делителей числа
			double sum = 0; // Сумма элементов первоначального массива, порядковые номера элементов которого являются простыми числами
			
			for ( double i = 0; i < nums.length; i++ ) {
				
				count = 0;
				
				for ( double j = 1; j <= (i + 1); j++) {
					
					if ( ( (i + 1) % j) == 0 ) {
						
						count ++;
					}
				}
						if ( count == 2 ) {
							
							sum = sum + nums[(int) i];
							System.out.println("-------------------------------------------------------------------------");
							
							System.out.printf( "Номер элемента массива : %3.0f  ||  Значение элемента массива :  %5.3f%n", i, nums[(int) i] );
							// System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[(int) i] );
							System.out.println("-------------------------------------------------------------------------");
						}
			}
			
			System.out.println("--------------------------------------------------------------------------------------------------");
			System.out.printf("Сумма элементов массива, порядковые номера элементов которого являются простыми числами : %5.3f%n", sum );
			System.out.println("--------------------------------------------------------------------------------------------------");
	}
	
}
