	
/*
	11. Написать метод(методы), определяющий, в каком из данных двух чисел больше цифр
*/
	
package Task_4_11;
	
import java.util.ArrayList;
	
public class Task_4_11 {
	
	public static void main(String[] args) {
		
		System.out.println("----------------------------------------------------------");
		System.out.println("ПРОГРАММА : ОПРЕДЕЛЕНИЕ, В КАКОМ ИЗ ДВУХ ЧИСЕЛ БОЛЬШЕ ЦИФР");
		System.out.println("----------------------------------------------------------");
		System.out.println("----------------------------------------------------------");
		
		Task_4_11_res Inp = new Task_4_11_res();
		
		// Ввод ПЕРВОГО натурального числа : A
		System.out.println("Введите ПЕРВОЕ натуральное число : A");
		System.out.println("------------------------------------");
		
		double A = 0;
		
		do {
			A = Inp.InputDouble();
			
			if ( A <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( A <= 0 );
		
		
		// Ввод ВТОРОГО натурального числа : B
		System.out.println("Введите ВТОРОЕ натуральное число : B");
		System.out.println("------------------------------------");
		
		double B = 0;
		
		do {
			B = Inp.InputDouble();
			
			if ( B <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
			
			} while ( B <= 0 );
		
		
		// Объявление массива, элементами которого являются цифры числа A
		ArrayList<Integer> arrayA = new ArrayList<Integer>();
		
		// Заполнение массива, элементами которого являются цифры числа A
		arrayA = Inp.numberEnter(A);
		
		// Объявление массива, элементами которого являются цифры числа B
		ArrayList<Integer> arrayB = new ArrayList<Integer>();
		
		// Заполнение массива, элементами которого являются цифры числа B
		arrayB = Inp.numberEnter(B);
		
		// Вывод на печать : Первое число A и второе число B, Цифры, входящие в первое число A и второе число B, количества цифр в числе A и числе B
		
		System.out.println("------------------------------------------------------------------------");
		System.out.println("------------------------------------------------------------------------");
		System.out.println("Первое число A : " + (int)A);
		System.out.println("------------------------------------------------------------------------");
		System.out.println("Цифры, входящие в первое число A :  " + arrayA);
		System.out.println("------------------------------------------------------------------------");
		System.out.println("Количество цифр в числе A : " + arrayA.size());
		
		System.out.println("------------------------------------------------------------------------");
		System.out.println("------------------------------------------------------------------------");
		
		System.out.println("Второе число B : " + (int)B);
		System.out.println("------------------------------------------------------------------------");
		System.out.println("Цифры, входящие во второе число B : " + arrayB );
		System.out.println("------------------------------------------------------------------------");
		System.out.println("Количество цифр в числе B : " + arrayB.size());
		System.out.println("------------------------------------------------------------------------");
		
		
		// Сравнение чисел A и B
		if ( arrayA.size() > arrayB.size() ) {
			
			System.out.println("--------------------------------------------------------------------------------------");
			System.out.println("Количество цифр, входящих в число A больше количества цифр, входящих в число B на : " + (arrayA.size() - arrayB.size()));
			System.out.println("--------------------------------------------------------------------------------------");
			
		}
		
		else if ( arrayA.size() == arrayB.size() ) {
			
			System.out.println("-----------------------------------------------------------------------------");
			System.out.println("Количество цифр, входящих в число A равно количеству цифр, входящих в число B");
			System.out.println("-----------------------------------------------------------------------------");
			
			
		}
		
		else if ( arrayA.size() < arrayB.size() ) {
			
			System.out.println("--------------------------------------------------------------------------------------");
			System.out.println("Количество цифр, входящих в число B больше количества цифр, входящих в число A на : " + (arrayB.size() - arrayA.size()));
			System.out.println("--------------------------------------------------------------------------------------");
		
		}
	}
	
}
