
/* 
  4. Даны действительные числа а1, а2, ..., аn. 
     Поменять местами наибольший и наименьший элементы.
*/

package Task_1_4;

import java.math.BigDecimal;
import java.math.RoundingMode;

public class Task_1_4 {

	public static void main(String[] args) {
		
		System.out.println("ПРОГРАММА : ЗАМЕНА НАИБОЛЬШЕГО ЭЛЕМЕНТА МАССИВА НАИМЕНЬШИМ, ЗАМЕНА НАИМЕНЬШЕГО ЭЛЕМЕНТА МАССИВА НАИБОЛЬШИМ");
		System.out.println("----------------------------------------------------------------------------------------------------------");
		System.out.println("----------------------------------------------------------------------------------------------------------");
		
		System.out.println("Введите размер массива A[N] : N");
		System.out.println("----------------------------------");
		
		Task_1_4_res Inp = new Task_1_4_res();
		
        int N = 0;
		 
		 do {
			 N = Inp.InputInt();
			 
			 if ( N <= 0 )
             {
           	  System.out.println("--------------------------------------------------");
           	  System.out.println("Введенные данные меньше или равно 0. Введите снова");
           	  System.out.println("--------------------------------------------------");
             } 
			 
		  } while ( N <= 0 );
		 
		  // Объявление одномерного массива размерностью N
		     double nums[] = new double[N];
		     
		     
		      // Заполнение массива рандомно
				double value = 0;
				
				for ( int i = 0; i < N; i++ ) {
					
					value = -100 + ( Math.random() * (100 - (-100) ) );
					BigDecimal result = new BigDecimal(value);
					
					result = result.setScale(3, RoundingMode.UP );
					nums[i] = result.doubleValue();
					}
				
				// Вывод первоначального массива на печать
			    System.out.println("-----------------------------------------");
				System.out.println("Вывод первоначального массива на печать :");
				System.out.println("-----------------------------------------");
				
			
                for ( int i = 0; i < nums.length; i++) {
			    	
		            System.out.println("---------------------------------------------------------------------");
		            System.out.printf( "Номер элемента массива : %2d  ||  Значение элемента массива : %5.3f%n", i, nums[i] );
		          //System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] );
		            System.out.println("---------------------------------------------------------------------");
					    } 
				 
		         System.out.println("---------------------------------------------------------------------");
		         
		         // Поиск Наибольшего элемента массива
		         
		         double max = nums[0]; // Наибольший элемента массива
		         int imax = 0; // Значение Наибольшего элемента массива
		         
		         for ( int i = 0; i < nums.length; i++) {
				    	
			            if ( nums[i] > max) {
			            	max = nums[i];
			            	imax = i;
			            } 
					}
		         
		         System.out.println("--------------------------------------------------------------------------------------------");
		         System.out.printf( "Номер Наибольшего элемента массива : %2d  ||  Значение Наибольшего элемента массива : %5.3f%n", imax, max);
		         System.out.println("--------------------------------------------------------------------------------------------");
		
		         
		        // Поиск Наименьшего элемента массива
		         
		         double min = nums[0]; // Наименьший элемент массива
		         int imin = 0; // Значение Наименьшего элемента массива
		         
		         for ( int i = 0; i < nums.length; i++) {
				    	
			            if ( nums[i] < min) {
			            	min = nums[i];
			            	imin = i;
			            } 
					}
		         
		         System.out.println("--------------------------------------------------------------------------------------------");
		         System.out.printf( "Номер Наименьшего элемента массива : %2d  ||  Значение Наименьшего элемента массива : %5.3f%n", imin, min);
		         System.out.println("--------------------------------------------------------------------------------------------");
		         
		         System.out.println("----------------------------------------------------------");
				 System.out.println("Замена Наибольшего элемента массива Наименьшим элементом :");
				 System.out.println("Замена Наименьшего элемента массива Наибольшим элементом :");
				 System.out.println("----------------------------------------------------------");
				 
				 // ЗАМЕНА НАИБОЛЬШЕГО ЭЛЕМЕНТА МАССИВА НАИМЕНЬШИМ, ЗАМЕНА НАИМЕНЬШЕГО ЭЛЕМЕНТА МАССИВА НАИБОЛЬШИМ
				 double exch;
				 
				 exch = nums[imin];
				 nums[imin] = nums[imax];
				 nums[imax] =  exch;
				 
			    // Вывод изменённого массива на печать
				   System.out.println("-------------------------------------");
				   System.out.println("Вывод изменённого массива на печать :");
				   System.out.println("-------------------------------------");
				   
				   for ( int i = 0; i < nums.length; i++) {
			            System.out.println("---------------------------------------------------------------------");
			            System.out.printf( "Номер элемента массива : %2d  ||  Значение элемента массива : %5.3f%n", i, nums[i] );
			          //System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] );
			            System.out.println("---------------------------------------------------------------------");
						   }
	}

}
