	
/*
	2. Написать метод (методы) для нахождения
	наибольшего общего делителя четырех натуральных чисел.
*/
	
package Task_4_2;
	
public class Task_4_2 {
	
	public static void main(String[] args) {
		
		System.out.println("----------------------------------------");
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ НОД ЧЕТЫРЁХ ЧИСЕЛ");
		System.out.println("----------------------------------------");
		System.out.println("----------------------------------------");
		
		// Ввод четырёх натуральных чисел
		System.out.println("--------------------------------");
		System.out.println("Ввод четырёх натуральных чисел :");
		System.out.println("--------------------------------");
		
		// Ввод ПЕРВОГО натурального числа
		System.out.println("Введите ПЕРВОЕ натуральное число : A");
		System.out.println("-------------------------------------");
		
		int A = 0;
		
		do {
			A = Task_4_2_res.InputInt();
			
			if ( A <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( A <= 0 );
		
		
		// Ввод ВТОРОГО натурального числа
		System.out.println("Введите ВТОРОЕ натуральное число : B");
		System.out.println("-------------------------------------");
		
		int B = 0;
		
		do {
			B = Task_4_2_res.InputInt();
			
			if ( B <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( B <= 0 );
		
		
		// Ввод ТРЕТЬЕГО натурального числа
		System.out.println("Введите ТРЕТЬЕ натуральное число : C");
		System.out.println("-------------------------------------");
		
		int C = 0;
		
		do {
			C = Task_4_2_res.InputInt();
			
			if ( C <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( C <= 0 );
		
		
		// Ввод ЧЕТВЁРТОГО натурального числа
		System.out.println("Введите ЧЕТВЁРТОЕ натуральное число : D");
		System.out.println("----------------------------------------");
		
		int D = 0;
			
			do {
				D = Task_4_2_res.InputInt();
				
				if ( D <= 0 )
					{
					System.out.println("--------------------------------------------------");
					System.out.println("Введенные данные меньше или равно 0. Введите снова");
					System.out.println("--------------------------------------------------");
					}
					
			} while ( D <= 0 );
			
			
		System.out.println("-------------------------------------------------------------------------------------------");
		System.out.println("ПЕРВОЕ ЧИСЛО : " + A + "  ||  " + "ВТОРОЕ ЧИСЛО : " + B + "  ||  " + "ТРЕТЬЕ ЧИСЛО : " + C + "  ||  " + "ЧЕТВЁРТОЕ ЧИСЛО : " + D);
		System.out.println("-------------------------------------------------------------------------------------------");
		
		// Вычисление наибольшего общего делителя четырёх натуральных чисел
		
		int nod1 = Task_4_2_res.Nod1(A, B);
		
		int nod2 = Task_4_2_res.Nod1(nod1, C);
		
		int nod3 = Task_4_2_res.Nod1(nod2, D);
		
		System.out.println("-----------------------------------------------------------");
		System.out.println("НАИБОЛЬШИЙ ОБЩИЙ ДЕЛИТЕЛЬ ЧЕТЫРЁХ НАТУРАЛЬНЫХ ЧИСЕЛ : " + nod3);
		System.out.println("-----------------------------------------------------------");
		
	}
	
}
