	
package Task_4_16;
	
import java.util.ArrayList;
	
import java.util.Scanner;
	
public class Task_4_16_res {
	
	// Ввод данных
	public int InputInt() {
		
		int check = 1;
		int x = 0;
		
		Scanner scanner = new Scanner(System.in);
		
		do {
			System.out.print("Введите Данные :.............: " + "  ");
			String xx = scanner.nextLine();
			
			check = 1;
			
			try {
				x = Integer.parseInt(xx);
				}
				catch (NumberFormatException e) {
				
				check = 0;
				System.out.println("------------------------------------------");
				System.out.println("Данные введены не правильно. Введите снова");
				System.out.println("------------------------------------------");
				}
			
			System.out.println("--------------------------------------");
			
			} while ( check == 0 );
			
		return x;
		}
	
	
	// Получение  n-значного числа
	public double Number ( int N ) {
		
		double Num = 0;
		
		for (int i = 1; i <= N; i++ ) {
			
			Num = Num * 10 + 9;
			
		}
		
		return Num;
	}
	
	
	// Метод для формирования массива, элементами которого являются цифры числа N
	public ArrayList numberEnter( double A ){
		
		ArrayList<Integer> array = new ArrayList<Integer>();
		
		while(A > 0) {
			
			int i = 0;
			
			double temp = A % 10;
			
			array.add(i, (int) temp);
			
			A = ( A - temp ) / 10;
			
			i++;
			
			}
			
			return array;
		}
	
	
	// Расчёт суммы n - значных чисел, содержащих только нечетные цифры
	public int Odd_Dig (ArrayList array ) {
		
		int check = 0;
		
		for ( int i = 0; i < array.size(); i++ ) {
			
			if ( (int) array.get(i) % 2 == 0 ) {
				
				check++;
			}
		}
		
		return check;
	}
	
	
	// Подсчёт чётных цифр в найденной сумме чисел, содержащих только нечётные цифры
	public int Ev_num (ArrayList array ) {
		
		int count = 0;
		
		System.out.println("------------------------------------------------------------------------------------------");
		System.out.print("Чётные цифры в найденной сумме чисел, содержащих только нечётные цифры : ");
		
		for( int i = 0; i < array.size(); i++ ) {
			
			if ( (int)array.get(i) % 2 == 0 ) {
				
				count++;
				
				System.out.print((int)array.get(i) + "  ");
			}
		
		}
		
		if ( count == 0  ) {
			
			System.out.print("НЕТ ЧЁТНЫХ ЦИФР");
		}
		
		System.out.println("");
		System.out.println("------------------------------------------------------------------------------------------");
		
		return count;
	}
	
	
	// Расчёт суммы n - значных чисел, содержащих только нечетные цифры. Подсчёт чётных цифр в найденной сумме
	public void Calculation( double Num_min, double Num_max) {
		
		// Расчёт суммы n - значных чисел, содержащих только нечетные цифры
		System.out.println("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		System.out.print("Числа которые содержат только нечетные цифры : ");
		
		double Sum = 0;
		
		for ( double i = Num_min; i <= Num_max; i++ ) {
			
			ArrayList array = numberEnter(i);
			
			int check = Odd_Dig(array);
			
			if ( check == 0 ) {
				
				System.out.print( (int)i + "  ");
				
				Sum = Sum + i;
				
			}
		
		}
		
		System.out.println("");
		System.out.println("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
		
		System.out.println("Сумма n - значных чисел, содержащих только нечетные цифры : " + (int)Sum);
		System.out.println("-----------------------------------------------------------------------");
		
		// Подсчёт чётных цифр в найденной сумме
		ArrayList array1 = numberEnter(Sum);
		
		int count = Ev_num (array1);
		
		if( count > 0 )
			{
			System.out.println("----------------------------------------------------------------------------------------");
			System.out.println("Количество чётных цифр в найденной сумме чисел, содержащих только нечётные цифры : " + count);
			System.out.println("----------------------------------------------------------------------------------------");
			}
	}
	
}
