	
/*
	3. Вычислить площадь правильного шестиугольника со стороной а,
	используя метод вычисления площади треугольника.
*/
	
package Task_4_3;
	
public class Task_4_3 {
	
	public static void main(String[] args) {
		
		System.out.println("---------------------------------------------------------");
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ ПЛОЩАДИ ПРАВИЛЬНОГО ШЕСТИУГОЛЬНИКА");
		System.out.println("---------------------------------------------------------");
		System.out.println("---------------------------------------------------------");
		
		System.out.println("-------------------------------------------");
		System.out.println("Ввод стороны правильного шестиугольника : а");
		System.out.println("-------------------------------------------");
		
		// Ввод стороны правильного шестиугольника : а
		System.out.println("Введите значение стороны правильного шестиугольника : а");
		System.out.println("-------------------------------------------------------");
		
		double A = 0;
		
		do {
			A = Task_4_3_res.Input();
			
			if ( A <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( A <= 0 );
		
		
		// Вычисление площади правильного шестиугольника
		
		// Правильный шестиугольник содержит 6 правильных (равносторонних) треугольников.
		
		double S = 6 * Task_4_3_res.Square(A);
		
		System.out.println("-------------------------------------------------------");
		System.out.println("ПЛОЩАДЬ ПРАВИЛЬНОГО ШЕСТИУГОЛЬНИКА : " + S);
		System.out.println("-------------------------------------------------------");
		
	}
	
}
