	
/*
	4. Сортировка обменами. Дана последовательность чисел : a1 <= a2 ... <= an. Требуется переставить числа в
		порядке возрастания. Для этого сравниваются два соседних числа : ai и ai+1. Если : ai > ai+1, то делается
		перестановка. Так продолжается до тех пор, пока все элементы не станут расположены в порядке возрастания.
		Составить алгоритм сортировки, подсчитывая при этом количества перестановок.
*/
	
package Task_3_4;
	
public class Task_3_4 {
	
	public static void main(String[] args) {
		
		System.out.println("-----------------------------------------------------");
		System.out.println("ПРОГРАММА : СОРТИРОВКА ПО ВОЗРАСТАНИЮ СПОСОБОМ ОБМЕНА");
		System.out.println("-----------------------------------------------------");
		System.out.println("-----------------------------------------------------");
		
		Task_3_4_res Inp = new Task_3_4_res();
		
		// Ввод одномерного массива
		System.out.println("Ввод одномерного массива A[X] :");
		System.out.println("-------------------------------");
		
		// Ввод одномерного массива
		System.out.println("Введите размер одномерного массива : X");
		System.out.println("--------------------------------------");
		int X = 0;
		
		do {
			X = Inp.InputInt();
		
		if ( X <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
		} while ( X <= 0 );
		
		// Объявление одномерного массива A[X]
		int A[] = new int[X];
		
		//Заполнение одномерного массива
		A = Inp.WriteMass(A, X);
		
		// Вывод на печать НЕСОРТИРОВАННОГО массива
		System.out.println("--------------------------------------------------------------");
		System.out.println("Вывод на печать НЕСОРТИРОВАННОГО массива. Размер массива : " + A.length);
		System.out.println("--------------------------------------------------------------");
		Inp.PrintMass(A);
		
		// СОРТИРОВКА МАССИВА ПО ВОЗРАСТАНИЮ СПОСОБОМ ОБМЕНА
		int move = 0;
		int temp = 0;
		int temp1 = 0;
		
		int count = 0;
		
		do {
			for ( int i = 0; i < A.length-1; i++ ) {
				
				temp = A[i];
				temp1 = A[i+1];
				
				if ( A[i] > A[i+1] ) { A[i] = temp1; A[i+1] = temp; move++; };
				
				temp = A[i];
				temp1 = A[i+1];
				
			}
			
			count = 0;
			for ( int i = 0; i < A.length-1; i++ ) {
			
				if ( A[i] > A[i+1] ) {count++; };
			}
			
			
		} while ( count > 0 );
		
		
		System.out.println("--------------------------------------------");
		System.out.println("Число перестановок элементов массива :  " + move);
		System.out.println("--------------------------------------------");
		
		System.out.println("----------------------------------------------------------------------------");
		System.out.println("Вывод на печать СОРТИРОВАННОГО МАССИВА МЕТОДОМ ОБМЕНА. Размер массива : " + A.length);
		System.out.println("----------------------------------------------------------------------------");
		Inp.PrintMass(A);
		
	}
	
}
