	
// 13. Отсортировать стобцы матрицы по возрастанию и убыванию значений элементов.
	
package Task_2_13;
	
public class Task_2_13 {
	
	public static void main(String[] args) {
		
		System.out.println("-------------------------------------------------------");
		System.out.println("ПРОГРАММА : ФОРМИРОВАНИЕ МАТРИЦЫ С СОРТИРОВКОЙ СТОЛБЦОВ");
		System.out.println("-------------------------------------------------------");
		
		System.out.println("Введите размер массива A[X][Y] :");
		System.out.println("------------------------------------");
		System.out.println("X - Число строк. Y - Число столбцов.");
		System.out.println("------------------------------------");
		
		
		// Ввод числа строк матрицы
		System.out.println("Введите :  X - Число строк : ");
		int X = 0;
		
		do {
			X = Task_2_13_res.InputInt();
			
			if ( X <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( X <= 0 );
		
		
		// Ввод числа столбцов матрицы
		System.out.println("Введите : Y - Число столбцов : ");
		
		int Y = 0;
		
		do {
			Y = Task_2_13_res.InputInt();
			
			if ( Y <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( Y <= 0 );
			
			// Объявление двумерного массива
			int[][] array = new int[X][Y];
			
			// Заполнение двумерного массива рандомно
			Task_2_13_res.FillMass( array, X, Y);
			
			// Вывод двумерного массива на печать
			System.out.println("-----------------------------------------------");
			System.out.println("Вывод начального двумерного массива на печать :");
			System.out.println("-----------------------------------------------");
			
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			Task_2_13_res.PrintMass(array);
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			
			// Cортировка столбцов матрицы по возрастанию значений элементов
			System.out.println("---------------------------------------------------------------------------------------------------");
			System.out.println("Вывод двумерного массива на печать. Cортировка столбцов матрицы по возрастанию значений элементов :");
			System.out.println("---------------------------------------------------------------------------------------------------");
			
			Task_2_13_res.SortPlus( array, X, Y );
			
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			Task_2_13_res.PrintMass(array);
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			
			// Cортировка столбцов матрицы по убыванию значений элементов
			System.out.println("------------------------------------------------------------------------------------------------");
			System.out.println("Вывод двумерного массива на печать. Cортировка столбцов матрицы по убыванию значений элементов :");
			System.out.println("------------------------------------------------------------------------------------------------");
			
			Task_2_13_res.SortMinus( array, X, Y );
			
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			Task_2_13_res.PrintMass(array);
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
	}
}
