	
/*
	10. Дан целочисленный массив с количеством элементов n.
		Сжать массив, выбросив из него каждый второй элемент.
		Освободившиеся элементы заполнить нулями.
		Примечание. Дополнительный массив не использовать.
*/
	
package Task_1_10;
	
import java.util.ArrayList;
	
public class Task_1_10 {
	
	public static void main(String[] args) {
		
		System.out.println("ПРОГРАММА : СЖАТИЕ МАССИВА");
		System.out.println("--------------------------");
		System.out.println("--------------------------");
		
		System.out.println("Введите размер массива A[N] : N - Размер массива");
		System.out.println("------------------------------------------------");
		
		Task_1_10_res Inp = new Task_1_10_res();
		
		int N = 0;
		
		do {
			N = Inp.InputInt();
			
			if ( N <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( N <= 0 );
		
		// Объявление одномерного массива размерностью N
		int nums[] = new int[N];
		
		// Заполнение массива рандомно
		for ( int i = 0; i < N; i++ ) {
			nums[i] = -100 + (int) ( Math.random()*(100-(-100)) );
			}
			
			// Вывод массива целых чисел на печать
		System.out.println("-------------------------------------");
		System.out.println("Вывод массива целых чисел на печать :");
		System.out.println("-------------------------------------");
		
		for ( int i = 0; i < nums.length; i++) {
			System.out.println("-------------------------------------------------------------------");
			
			System.out.printf( "Номер элемента массива : %3d  ||  Значение элемента массива : %4d%n", i, nums[i] );
			// System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] );
			System.out.println("-------------------------------------------------------------------");
			}
			
			System.out.println("-------------------------------------------------------------------");
			
		// Сжатие массива, удаление из него каждого второго элемента. Заполнение освободившихся элементов нулями.
		
		for ( int i = 0; i < nums.length; i++) {
			
			if( ((i+1) % 2) == 0 ) {
			nums [i] = 0;
			}
		}
		
		// Вывод изменённого массива целых чисел на печать
		System.out.println("-------------------------------------");
		System.out.println("Вывод массива целых чисел на печать :");
		System.out.println("-------------------------------------");
		
		for ( int i = 0; i < nums.length; i++) {
			System.out.println("-------------------------------------------------------------------");
			
			System.out.printf( "Номер элемента массива : %3d  ||  Значение элемента массива : %4d%n", i, nums[i] );
			// System.out.println("Номер элемента массива :  " +  i + "  ||  " + "Значение элемента массива :  " + nums[i] );
			System.out.println("-------------------------------------------------------------------");
		}
		
		System.out.println("-------------------------------------------------------------------");
	}
	
}
