	
/*
	14. Сформировать случайную матрицу m x n ( X x Y ), состоящую из нулей и единиц,
		причем в каждом столбце число единиц равно номеру столбца.
*/
	
package Task_2_14;
	
public class Task_2_14 {
	
	public static void main(String[] args) {
		
		System.out.println("--------------------------------");
		System.out.println("ПРОГРАММА : ФОРМИРОВАНИЕ МАТРИЦЫ");
		System.out.println("--------------------------------");
		
		System.out.println("Введите размер массива A[X][Y] :");
		System.out.println("------------------------------------");
		System.out.println("X - Число строк. Y - Число столбцов.");
		System.out.println("------------------------------------");
		System.out.println("Число строк (X) больше или равно числу столбцов (Y)");
		System.out.println("---------------------------------------------------");
		
		// Ввод числа строк матрицы
		System.out.println("Введите :  X - Число строк : ");
		int X = 0;
		
		do {
			X = Task_2_14_res.InputInt();
			
			if ( X <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
		} while ( X <= 0 );
		
		
		// Ввод числа столбцов матрицы
		System.out.println("Введите : Y - Число столбцов : ");
		
		int Y = 0;
			
			do {
				Y = Task_2_14_res.InputInt();
				
				if ( Y <= 0 )
					{
					System.out.println("--------------------------------------------------");
					System.out.println("Введенные данные меньше или равно 0. Введите снова");
					System.out.println("--------------------------------------------------");
					}
					
				if ( X < Y )
					{
					System.out.println("-----------------------------------------------------------------------");
					System.out.println("Число столбцов (Y) больше Числа строк (X). Введите снова Число столбцов");
					System.out.println("-----------------------------------------------------------------------");
					}
					
			} while ( Y <= 0 | X < Y );
			
			
			// Объявление двумерного массива
			int[][] array = new int[X][Y];
			
			// Заполнение двумерного массива :
			
			/*
			Формирование случайной матрицы m x n ( X x Y ),
			состоящей из нулей и единиц, причем
			в каждом столбце число
			единиц равно номеру столбца.
			*/
			
			Task_2_14_res.FillMass(array, X, Y);
			
			// Вывод двумерного массива на печать
			System.out.println("----------------------------------- ");
			System.out.println("Вывод двумерного массива на печать :");
			System.out.println("------------------------------------");
			
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
			Task_2_14_res.PrintMass(array);
			System.out.println("-----------------------------------------------------------------------------------------------------------------------------------------------------------------");
	}
	
}
