	
/*
	14. Натуральное число, в записи которого n цифр, называется числом Армстронга,
	если сумма его цифр, возведенная в степень n, равна самому числу.
	Найти все числа Армстронга от 1 до k. Для решения задачи использовать декомпозицию.
*/
	
package Task_4_14;
	
public class Task_4_14 {
	
	public static void main(String[] args) {
		
		System.out.println("----------------------------------");
		System.out.println("ПРОГРАММА : ПОИСК ЧИСЕЛ АРМСТРОНГА");
		System.out.println("----------------------------------");
		
		Task_4_14_res Inp = new Task_4_14_res();
		
		// Ввод натурального числа K
		System.out.println("Введите натуральное число : K");
		System.out.println("-----------------------------");
		
		int K = 0;
		
		do {
			K = Inp.InputInt();
			
			if ( K <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равны 2. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( K <= 0 );
		
		
		// Вычисление чисел Армстронга на промежуте от 1 до k
		System.out.println("----------------------------------------------------");
		System.out.println("ВЫЧИСЛЕНИЕ ЧИСЕЛ АРМСТРОНГА НА ПРОМЕЖУТЕ ОТ 1 ДО K :");
		System.out.println("----------------------------------------------------");
		
		System.out.println("-----------------------------------------------------------------------------------------");
		
		for ( int i = 1; i <= K; i++ ) {
			
			int Count = Inp.Count(i);
			
			int Arm = Inp.Sum ( i, Count );
			
			if ( Arm == i ) {
				
				System.out.println("Число : " + i + "  " + "Сумма цифр в числе, возведённых в степень количества цифр : " + Count + "  равна  " + Arm );
				System.out.println("-----------------------------------------------------------------------------------------");
			}
		}
		
	}
	
}
