	
/*
	8. Задан массив D. Определить следующие суммы :
	D[0] + D[1] + D[2], D[3] + D[4] + D[5], D[6] + D[7] + D[8], ... , D[i] + D[i+1] + D[i+2]
	Пояснение. Составить метод (методы) для вычисления суммы
	трёх последовательно расположенных элементов массива с номерами от k до m.
*/
	
package Task_4_8;
	
public class Task_4_8 {
	
	public static void main(String[] args) {
	
	System.out.println("------------------------------------------------------------------------------------------------------");
	System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ СУММЫ ТРЁХ ПОСЛЕДОВАТЕЛЬНО РАСПОЛОЖЕННЫХ ЭЛЕМЕНТОВ МАССИВА С НОМЕРАМИ ОТ K ДО M");
	System.out.println("------------------------------------------------------------------------------------------------------");
	System.out.println("------------------------------------------------------------------------------------------------------");
	
	// Ввод размера массива
	System.out.println("-------------------------------");
	System.out.println("Введите размер массива D[N] : N");
	System.out.println("-------------------------------");
	
	System.out.println("Введите размер массива : N");
	System.out.println("--------------------------");
	
	int N = 0;
	
	do {
		N = Task_4_8_res.InputInt();
		
		if ( N <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
		} while ( N <= 0 );
	
	
	// Ввод номеров элементов массива : Начального элемента - k и Конечного элемента - m. Количество элементов массива кратно ТРЁМ
	System.out.println("---------------------------------------------------------------------------------");
	System.out.println("Ввод номеров элементов массива : Начального элемента - k и Конечного элемента - m");
	System.out.println("---------------------------------------------------------------------------------");
	System.out.println("Количество выбранных элементов массива кратно ТРЁМ");
	System.out.println("--------------------------------------------------");
	
	// Ввод номера Начального элемента массива - k
	System.out.println("Введите номер Начального элемента массива - k");
	System.out.println("---------------------------------------------");
	
	int K = 0;
	
	do {
		K = Task_4_8_res.InputInt();
		
		if ( K <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
			if ( K > N )
			{
			System.out.println("-------------------------------------");
			System.out.println("Элемента в массиве нет. Введите снова");
			System.out.println("-------------------------------------");
			}
			
		} while ( K <= 0 | K > N );
		
		
	// Ввод Конечного элемента массива - m
	System.out.println("Введите номер Конечного элемента массива - m");
	System.out.println("--------------------------------------------");
	
	int M = 0;
	
	do {
		M = Task_4_8_res.InputInt();
			
			if ( M > N )
			{
			System.out.println("-------------------------------------");
			System.out.println("Элемента в массиве нет. Введите снова");
			System.out.println("-------------------------------------");
			}
			
			if ( M <= 0 )
			{
			System.out.println("--------------------------------------------------");
			System.out.println("Введенные данные меньше или равно 0. Введите снова");
			System.out.println("--------------------------------------------------");
			}
			
			if ( M >= K & ( ( M - K) + 1 ) % 3 != 0 & M <= N )
			{
			System.out.println("--------------------------------------------------------------------");
			System.out.println("Выбранное количество элементов массива не кратно ТРЁМ. Введите снова");
			System.out.println("--------------------------------------------------------------------");
			}
			
			if ( K > M & M > 0)
			{
			System.out.println("----------------------------------------------------------------------------------");
			System.out.println("Номер Начального элемента массива - k больше номера Конечного элемента массива - m");
			System.out.println("----------------------------------------------------------------------------------");
			}
			
			if ( K == M )
			{
			System.out.println("---------------------------------------------------------------------------------");
			System.out.println("Номер Начального элемента массива - k равен Номеру Конечного элемента массива - m");
			System.out.println("---------------------------------------------------------------------------------");
			}
			
		} while ( M <= 0 | K > M | K == M | ( ( M - K) + 1 ) % 3 != 0 | M > N );
		
		
		// Объявление одномерного массива размерностью N
		int D[] = new int[N];
		
		// Заполнение одномерного массива рандомно
		D = Task_4_8_res.WriteMass(D);
		
		// Вывод массива на печать
		System.out.println("-------------------------");
		System.out.println("Вывод массива на печать :");
		System.out.println("-------------------------");
		Task_4_8_res.PrintMass(D);
		
		
		// Вычисление сумм трёх последовательно расположенных элементов массива с номерами от k до m
		System.out.println("-------------------------------------------------------------------------------------------");
		System.out.println("Вычисление сумм трёх последовательно расположенных элементов массива с номерами от k до m :");
		System.out.println("-------------------------------------------------------------------------------------------");
		
		Task_4_8_res.SummMass ( D, K, M );
		
	}
}
