	
/*
	8. Задан массив D. Определить следующие суммы :
	D[1] + D[2] + D[3], D[3] + D[4] + D[5], D[4] + D[5] + D[6]
	Пояснение. Составить метод (методы) для вычисления суммы
	трёх последовательно расположенных элементов массива с номерами от k до m.
*/
	
package Task_4_8;
	
public class Task_4_8_1 {
	
	public static void main(String[] args) {
		
		System.out.println("------------------------------------------------------------------------------------------------------");
		System.out.println("ПРОГРАММА : ВЫЧИСЛЕНИЕ СУММЫ ТРЁХ ПОСЛЕДОВАТЕЛЬНО РАСПОЛОЖЕННЫХ ЭЛЕМЕНТОВ МАССИВА С НОМЕРАМИ ОТ K ДО M");
		System.out.println("------------------------------------------------------------------------------------------------------");
		System.out.println("------------------------------------------------------------------------------------------------------");
		
		Task_4_8_res Inp = new Task_4_8_res();
		
		// Ввод размера массива
		System.out.println("-----------------------------");
		System.out.println("Ввод размера массива D[N] : N");
		System.out.println("-----------------------------");
		
		System.out.println("Введите размер массива : N");
		System.out.println("--------------------------");
		
		int N = 0;
		
		do {
			N = Inp.InputInt();
			
			if ( N <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( N <= 0 );
		
		// Ввод номеров элементов массива : Начального элемента - k и Конечного элемента - m.
		System.out.println("---------------------------------------------------------------------------------");
		System.out.println("Ввод номеров элементов массива : Начального элемента - k и Конечного элемента - m");
		System.out.println("---------------------------------------------------------------------------------");
		
		// Ввод номера Начального элемента массива - k
		System.out.println("Введите номер Начального элемента массива - k");
		System.out.println("---------------------------------------------");
		
		int K = 0;
		
		do {
			K = Inp.InputInt();
					
				if ( K <= 0 )
					{
					System.out.println("--------------------------------------------------");
					System.out.println("Введенные данные меньше или равно 0. Введите снова");
					System.out.println("--------------------------------------------------");
					}
				
					if ( K > N )
					{
					System.out.println("-------------------------------------");
					System.out.println("Элемента в массиве нет. Введите снова");
					System.out.println("-------------------------------------");
					}
						
				} while ( K <= 0 | K > N );
		
		// Ввод номера Конечного элемента массива - m
		System.out.println("Введите номер Конечного элемента массива - m");
		System.out.println("--------------------------------------------");
		
		int M = 0;
		
		do {
			M = Inp.InputInt();
			
					if ( M > N )
					{
					System.out.println("-------------------------------------");
					System.out.println("Элемента в массиве нет. Введите снова");
					System.out.println("-------------------------------------");
					}
					
				if ( M <= 0 )
					{
					System.out.println("--------------------------------------------------");
					System.out.println("Введенные данные меньше или равно 0. Введите снова");
					System.out.println("--------------------------------------------------");
					}
				
				
					if ( K > M )
					{
					System.out.println("----------------------------------------------------------------------------------");
					System.out.println("Номер Начального элемента массива - k больше номера Конечного элемента массива - m");
					System.out.println("----------------------------------------------------------------------------------");
					}
				
					if ( K == M )
					{
					System.out.println("---------------------------------------------------------------------------------");
					System.out.println("Номер Начального элемента массива - k равен номеру Конечного элемента массива - m");
					System.out.println("---------------------------------------------------------------------------------");
					}
						
				} while ( M <= 0 | K > M | K == M | M > N );
		
		
		// Объявление одномерного массива размерностью N
		int D[] = new int[N];
				
		// Заполнение одномерного массива рандомно
		D = Inp.WriteMass(D);
				
		// Вывод массива на печать
		System.out.println("-------------------------");
		System.out.println("Вывод массива на печать :");
		System.out.println("-------------------------");
		Inp.PrintMass(D);
		
		int check = 0;
		
		int L = 0;
		
		do {
			// Ввод номера массива, с которого нужно начать вывод сумм трёх последовательно расположенных элементов массива на печать
			System.out.println("--------------------------------------------------------------------------------------------------------------------------");
			System.out.println("Введите номер массива, с которого нужно начать вывод сумм трёх последовательно расположенных элементов массива на печать :");
			System.out.println("--------------------------------------------------------------------------------------------------------------------------");
		
			// Ввод номера массива, с которого нужно начать вывод сумм трёх последовательно расположенных элементов массива на печать
			System.out.println("Введите номер массива :");
			System.out.println("-----------------------");
				
			do {
				L = Inp.InputInt();
					
				if ( L <= 0 )
					{
					System.out.println("--------------------------------------------------");
					System.out.println("Введенные данные меньше или равно 0. Введите снова");
					System.out.println("--------------------------------------------------");
					}
			
					else if (L < K | (L+3) > M) {
				
					System.out.println("------------------------------------------------------------------------------------------------------------------");
					System.out.println("Номер элемента массива для вычисления суммы трёх последовательно расположенных элементов массива задан неправильно");
					System.out.println("------------------------------------------------------------------------------------------------------------------");
					}
					
				} while ( L <= 0 | L < K | (L+3) > M);
				
		
			// Вычисление сумм трёх последовательно расположенных элементов массива с номерами от k до m
			System.out.println("-------------------------------------------------------------------------------------------");
			System.out.println("Вычисление сумм трёх последовательно расположенных элементов массива с номерами от k до m :");
			System.out.println("-------------------------------------------------------------------------------------------");
			Inp.SummMass1 ( D, K, M, L);
			
			// Запрос на повтор программы
			check = Inp.Repeat();
			
			try {
				Thread.sleep(1500);
				}
				catch(InterruptedException ex)
					{
					System.out.println("-------------------------");
					System.out.println("Ошибка в работе программы");
					System.out.println("-------------------------");
					}
		
		} while ( check == 1 );
		
	}
	
}
