	
/*
	12. Даны натуральные числа К и N.
	Написать метод(методы) формирования массива А, элементами которого являются числа,
	сумма цифр которых равна К и которые не большее N.
*/
	
package Task_4_12;
	
import java.util.ArrayList;
	
public class Task_4_12 {
	
	public static void main(String[] args) {
		
		System.out.println("------------------------------------");
		System.out.println("ПРОГРАММА : ФОРМИРОВАНИЯ МАССИВА : А");
		System.out.println("------------------------------------");
		System.out.println("------------------------------------");
		
		Task_4_12_res Inp = new Task_4_12_res();
		
		// Ввод натурального числа : K
		System.out.println("Введите натуральное число : K");
		System.out.println("-----------------------------");
		System.out.println("Сумма цифр элемента массива A равна K");
		System.out.println("-------------------------------------");
		
		int K = 0;
		
		do {
			K = Inp.InputInt();
			
			if ( K <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( K <= 0 );
		
		
		// Ввод натурального числа : N
		System.out.println("Введите натуральное число : N");
		System.out.println("-----------------------------");
		System.out.println("Значение элемента массива A не больше N");
		System.out.println("---------------------------------------");
		
		int N = 0;
		
		do {
			N = Inp.InputInt();
			
			if ( N <= 0 )
				{
				System.out.println("--------------------------------------------------");
				System.out.println("Введенные данные меньше или равно 0. Введите снова");
				System.out.println("--------------------------------------------------");
				}
				
			} while ( N <= 0 );
		
		
		System.out.println("--------------------------------------------------------------------------------------------");
		System.out.println("Сумма цифр элемента массива A равна K : " + K + "   " + "Значение элемента массива A не больше N : " + N);
		System.out.println("--------------------------------------------------------------------------------------------");
		
		
		// Объявление массива A, элементами которого являются числа, сумма цифр которых равна К и которые не большее N
		ArrayList<Integer> A = new ArrayList<Integer>();
		
		for ( int i = 1; i <= N; i++ ) {
			
			int Temp = Inp.Sum(i);
			
			if ( Temp == K ) {
				
				A.add(i);
			}
		}
		
		// Вывод на печать массива A
		System.out.println("-------------------------");
		System.out.println("ВЫВОД НА ПЕЧАТЬ МАССИВА :");
		System.out.println("--------------------------------------------------------------------------------------");
		System.out.println(A);
		System.out.println("--------------------------------------------------------------------------------------");
	}
	
}
